vikramdattu/amazon-kinesis-video-streams-webrtc-sdk-c-espressif-port/examples/linux_test/sdkconfig.defaults
# Linux-target defaults.
# The Linux IDF target deliberately keeps the surface area minimal; most
# ESP-IDF Kconfig options simply don't exist here. Only the project's
# own knobs land in this file.

CONFIG_IDF_TARGET="linux"

# Use the upstream libwebsockets-based signaling path on Linux. The
# ESP-websocket-client variant is built around lwip + ESP-specific
# socket APIs and isn't portable to the host stack.
CONFIG_USE_ESP_WEBSOCKET_CLIENT=n

# WebRTC needs DTLS over SRTP (RFC 5764) — KVS's Dtls_mbedtls.c uses
# mbedtls_ssl_srtp_profile, mbedtls_ssl_conf_dtls_srtp_protection_profiles,
# etc. ESP-target builds get these enabled implicitly via esp-tls; the
# Linux IDF target needs them turned on explicitly.
CONFIG_MBEDTLS_SSL_PROTO_DTLS=y
CONFIG_MBEDTLS_SSL_DTLS_SRTP=y

# Use upstream KVS Tls_mbedtls.c on Linux. The Tls_esp.c variant needs
# esp_tls.h + esp_crt_bundle.h, which are ESP-only.
CONFIG_USE_ESP_TLS_FOR_KVS=n
